# Площі

calc_area_1 = 1761.5  # float(input("\nПлоща зовнішніх стін: "))
calc_area_1_1 = 148.6  # float(input("\nПлоща зовнішніх стін нижче відмітки 0.00: "))
calc_area_1_2 = 203.62  # float(input("\nПлоща стін підвалу нижче поверхні землі: "))
calc_area_2 = 758.8  # float(input("\nПлоща перекриття над підвалом, техпідпіллям: "))
calc_area_3_1 = 526.8
calc_area_3_2 = 475.0
calc_area_3_3 = 409.2
calc_area_3_4 = 296.8
calc_area_3 = 1707.8  # float(input("\nПлоща підлоги по грунту: "))
calc_area_4 = 2271.8  # float(input("\nПлоща горищного перекриття: "))
calc_area_5 = 554.7  # float(input("\nПлоща світлопрозорих конструкцій: "))
calc_area_6 = 36.26  # float(input("\nПлоща вхідних дверей: "))
calc_area_7 = 3769.9  # float(input("\nРОзрахункова площа будинку: "))
calc_all_initial = calc_area_1 + calc_area_2 + calc_area_3 + calc_area_4 + calc_area_5 + calc_area_6

########################################################################################################################

# Об'єм

calc_volume_1 = 15458.1  # float(input("\nОпалювальний об'єм будинку: "))
########################################################################################################################

# Пункт 3.7

r_t_s = 0.75  # опір світлопрозорих конструкцій
r_d = 0.5  # опір дверей
e = 1.1

########################################################################################################################

# пункт 5 формула (3) ДСТУ_Н Б.А.2.2-5

z_op = 195  # float(input("\nТривалість опалювального періоду: "))
t_v = 21  # float(input("\nРозрахункова температура внутрішнього повітря будівлі: "))
t_n = 5
t_z = -22
t_op = 0.7  # float(input("\nРозрахункова температура зовнішнього повітря: "))
d_d = (t_v - t_op) * z_op  # Кількість градусо_діб
x1 = 0.024  # розмірний коефіцієнт

########################################################################################################################

# пункт 3.7 формула (12) ДСТУ_Н Б.А.2.2-5

l_v = 7 * calc_area_7  # нормативне значення кількості припливного повітря під час механічної вентиляції
n_v = 48  # Кількість годин механічної вентиляції протягом тижня: "
nu = 0.7  # "Коефіцієнт впливу зустрічного теплового потоку в огороджувальні конструкції: "
n_inf = (168 - 48)  # float(input("Кількість годин інфільтрації протягом тижня: "))
v_v = 0.85  # Коефіцієнт зниження об'єму повітря у будинку
p_inf = 0.5 * v_v * calc_volume_1  # Кількість повітря, що інфільтрується в будинок через огороджувальні конструкції

########################################################################################################################

# пункт 5 формула (8) ДСТУ_Н Б.А.2.2-5

x2 = 0.278  # розмірний коефіцієнт
c = 1  # питома теплоємність повітря

########################################################################################################################

# пункт 5 формула (14) ДСТУ_Н Б.А.2.2-5

e_v_in = 0.8  # для двокамерних склопакетів з 4К внутрішнім склом в одинарних плетіннях з ПВХ профілів
e_v_out = 0.68  # для двокамерних склопакетів з 4К зовнішнім склом в одинарних плетіннях з ПВХ профілів

########################################################################################################################

# пункт 5 формула (2) ДСТУ_Н Б.А.2.2-5

v_coef = 0.8  # коефіцієнт, що враховує здатність огороджувальних конструкцій акумулювати або віддавати тепло під
# час періодичного теплового режиму
eps_coef = 0.95  # коефіцієнт авторегулювання подачі тепла в системах опалення
beta_h_coef = 1.13  # коефіцієнт, що враховує додаткове теплоспоживання системи опалення, пов'язане з дискретністю
# номінального теплового потоку номенклатурного ряду опалювальних приладів та додатковими тепловитратами через
# неопалювальні приміщення

########################################################################################################################

#  кортежи информации для пунктов 3.1.1 , 3.1.2, 3.2, 3.3

thermal_calculation_inside_wall_array = [[0.05, 0.93], [0.05, 0.93], [0.2, 0.048], [0.01, 0.93], [0.51, 0.87],
                                         [0.02, 0.81]]
thermal_calculation_inside_wall_zero_array = [[0.006, 1.1], [0.005, 0.93], [0.14, 0.048], [0.5, 1.86], [0.02, 0.81]]

thermal_calculation_basement_underground_array = [[0.14, 0.048]]

thermal_calculation_of_the_attic_floor_array = [[0.04, 0.93], [0.23, 0.05], [0.22, 2.04]]
thermal_calculation_overlap_over_the_underground_array = [[0.01, 1.1], [0.015, 0.08], [0.055, 0.65], [0.22, 2.04],
                                                          [0.05, 0.048], [0.02, 0.81]]

thermal_calculation_of_the_basement_floor_array = [[0.05, 0.053]]

######################################################################################################################

# init_data для пунктов 3.1.3, 3.4

init_list_3_1_3 = [1]

init_list_3_4 = [1, 2, 3, 4]

########################################################################################################################

# init data для пункта 3.1.4

init_list_3_1_4 = [1, 14, 15, 16]